app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "mleko"], ["todo_list_id", 3], ["created_at", "2015-07-06 18:43:13.911109"], ["updated_at", "2015-07-06 18:43:13.911109"]]
---
  def create
    @todo_item = @todo_list.todo_items.new(todo_item_params)
    if @todo_item.save

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 5]]
---
  def edit
    @todo_item = @todo_list.todo_items.find(params[:id])

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 5]]
UPDATE "todo_items" SET "content" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["content", "Lots of Milk"], ["updated_at", "2015-07-06 21:46:01.279148"], ["id", 1]]
---
  def update
    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.update_attributes(todo_item_params)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 4]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 4]]
---
  def destroy
    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.destroy

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 5]]
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-08-07 22:10:20.917809"], ["updated_at", "2015-08-07 22:10:20.918191"], ["id", 5]]
---
  def complete
    @todo_item = @todo_list.todo_items.find(params[:id])
    @todo_item.update_attribute(:completed_at, Time.now)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 3]]
---
  def find_todo_list
    @todo_list = TodoList.find(params[:todo_list_id])