app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Windows"], ["description", "clean them all"], ["created_at", "2015-06-19 08:44:52.756750"], ["updated_at", "2015-06-19 08:44:52.756750"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["title", "New title"], ["description", "New description"], ["updated_at", "2015-06-19 19:24:20.969045"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)